; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (clear ?x)
               (on-table ?x)
               (arm-empty)
               (holding ?x)
               (on ?x ?y))

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
                 (not (arm-empty))))

  (:action putdown
    :parameters  (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
                 (not (holding ?ob))))

  (:action stack
    :parameters  (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
                 (not (clear ?underob)) (not (holding ?ob))))

  (:action unstack
    :parameters  (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
                 (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-9)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 )
(:init
(arm-empty)
(on-table b1)
(on-table b2)
(on b3 b4)
(on b4 b1)
(on-table b5)
(on-table b6)
(on b7 b8)
(on b8 b5)
(on-table b9)
(clear b2)
(clear b3)
(clear b6)
(clear b7)
(clear b9)
)
(:goal
(and
(on b1 b7)
(on-table b2)
(on-table b3)
(on b4 b3)
(on b5 b9)
(on b6 b1)
(on-table b7)
(on b8 b6)
(on b9 b8))
)
)

; plan
1. (unstack b3 b4)
   deleted: (on b3 b4) (clear b3) (arm-empty)
   added: (holding b3) (clear b4)
   goals met: 1 of 9
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 9
3. (unstack b7 b8)
   deleted: (on b7 b8) (clear b7) (arm-empty)
   added: (holding b7) (clear b8)
   goals met: 2 of 9
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 3 of 9
5. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 3 of 9
6. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 4 of 9
7. (unstack b4 b1)
   deleted: (on b4 b1) (clear b4) (arm-empty)
   added: (holding b4) (clear b1)
   goals met: 4 of 9
8. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 5 of 9
9. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 9
10. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 6 of 9
11. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 6 of 9
12. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 7 of 9
13. (unstack b9 b8)
   deleted: (on b9 b8) (clear b9) (arm-empty)
   added: (holding b9) (clear b8)
   goals met: 6 of 9
14. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 6 of 9
15. (unstack b8 b5)
   deleted: (on b8 b5) (clear b8) (arm-empty)
   added: (holding b8) (clear b5)
   goals met: 6 of 9
16. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 7 of 9
17. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 7 of 9
18. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 8 of 9
19. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 8 of 9
20. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 9 of 9
